app/controllers/arduinos_controller.rb

  def index
    @arduinos = Arduino.all
---
SELECT "arduinos".* FROM "arduinos"

  def create
    @arduino = Arduino.new(arduino_params)

    respond_to do |format|
      if @arduino.save
---
INSERT INTO "arduinos" ("b1", "b2", "b3", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["b1", 15.0], ["b2", 2.0], ["b3", 3.0], ["created_at", 2017-03-10 14:23:42 UTC], ["updated_at", 2017-03-10 14:23:42 UTC]]

    def set_arduino
      @arduino = Arduino.find(params[:id])
---
SELECT  "arduinos".* FROM "arduinos" WHERE "arduinos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]